{
  "beyond_classical_immunity:_mast_cells_as_signal_converters_between_tissues_and_neurons": "Authors: Thomas Plum, Thorsten B. Feyerabend, Hans-Reimer Rodewald\nJournal: Immunity\nDOI: 10.1016/j.immuni.2024.11.016\nKeywords: mast cells; neuroimmunology; allergy; toxin hypothesis; allergic reflexes; innervation; nociception; IgE; MrgprB2; signal converters",
  "summary": "Mast cells are regarded as effectors in immune defense against parasites and venoms and play an essential role in the pathology of allergic diseases. More recently, mast cells have been shown to receive stimuli derived from type 2 immunity, tissue damage, stress, and inflammation. Mast cells then rapidly convert these diverse signals into appropriate, organ-specific protective reflexes that can limit inflammation or reduce tissue damage. In this review, we consider functions of mast cells in sensations—such as pain, itch, and nausea—arising from tissue insults and inflammation and the ensuing protective responses. In light of emerging data highlighting the involvement of mast cells in neuroimmune communication, we also propose that mast cells are “signal converters” linking immunological and tissue states with nervous system responses.",
  "keywords": "1. mast cells\n  2. neuroimmunology\n  3. allergy\n  4. toxin hypothesis\n  5. allergic reflexes\n  6. innervation\n  7. nociception\n  8. IgE\n  9. MrgprB2\n  10. signal converters",
  "introduction": "Mast cells belong to the hematopoietic system. (Ref: 1) They develop from progenitors in yolk sac (Ref: 2) and fetal blood (Ref: 3) and from adult bone marrow. (Ref: 2) Mature mast cells can be viewed as tissue-resident cells, located mainly at the body’s interface to the environment. Mast cells are absent from bone marrow and blood. Mast cells often reside in close proximity to blood vessels (Ref: 4) and neurons (Ref: 5) (Ref: 6) and they have long lifespans (between 3 and 10 months in rodents). (Ref: 7) (Ref: 8) Mast cells are present in many species, including amphibians, reptiles, and mammals. “Mast-cell-like cells” have been described in the invertebrate Styela plicata (Chordata-Tunicata), (Ref: 9) dating back approximately 680 million years, making it evolution’s oldest known organism with such cells. Therefore, mast cells predate the emergence of adaptive immunity by more than 100 million years. (Ref: 10) In brief, mast cells are tissue-resident, long-lived, evolutionarily ancient cells that have been maintained in mice and humans, which are the focus of this review.\n      Mast cells were discovered by their “metachromasia” (turning purple upon staining with blue dyes) and their distinctive, granule-filled morphology. (Ref: 11) The granules within mast cells store large amounts of biologically active compounds, including proteoglycans such as heparin and chondroitin sulfate (which are responsible for the metachromasia); specific proteases, like chymases (e. g., mast cell protease [Mcpt] 4 or 5), tryptase (e. g., Mcpt6), and carboxypeptidase A3 (Cpa3); and the monoamines histamine and serotonin (5-hydroxytryptamine or 5-HT). (Ref: 12) (Ref: 13) In mice and humans, mast cells are generally classified into mucosal (e. g., in the mucosal layers of the gastrointestinal tract and the airways) and connective-tissue mast cells (e. g., in skin). (Ref: 12) Apart from their location, both subsets differ in their produced mediators, responsiveness to stimulating ligands, and signals required for their growth and maturation. For instance, mucosal mast cell numbers are generally low and depend on microbial and inflammatory signals, whereas connective-tissue mast cells are constitutively present at steady state and their numbers also increase in response to inflammation. (Ref: 12) (Ref: 14) With the advent of sensitive single-cell RNA sequencing technology, it is now being recognized that mast cells express tissue-specific transcriptomes (Ref: 15) that may define further subsets beyond the classical mucosal versus connective-tissue phenotypes.\n      The best-studied mast cell trigger is activation of the high-affinity immunoglobulin E (IgE) receptor (FcεRI) by antigen. (Ref: 16) FcεRI is a tetrameric complex (αβγ2) composed of α, β, and γ chains. (Ref: 16) The α-subunit contains the binding site for IgE, whereas β and γ chains are important for signal transduction. (Ref: 16) The γ chain is not specific for FcεRI but also serves as a signaling subunit for FcγRI and FcγRIII, which can also be expressed by mast cells. (Ref: 17) The γ chain, functionally redundant with the T cell antigen receptor CD3 ζ chain, (Ref: 18) possesses immunoreceptor tyrosine-based activation motifs (ITAMs) (Ref: 19) within its intracellular domain. Following receptor activation, tyrosine residues within the ITAM are targeted by Src family kinases, initiating intracellular signaling events resulting in calcium mobilization as well as activation of PLCγ1 and PI-3 kinase. (Ref: 16) (Ref: 17) Following these events, mast cells rapidly release preformed mediators stored in secretory granules and newly synthesized molecules such as lipid mediators derived from arachidonic acid, cytokines, and chemokines. (Ref: 12) (Ref: 13) (Ref: 20) Mast-cell-expressed FcεRIα binds with high affinity to the Fc-portion of IgE (dissociation constant 10−10 M), (Ref: 21) leading to stably bound IgE on the mast cell surface for up to several weeks. (Ref: 22)In vivo, mast cells are probably never devoid of bound IgE. FcγRI and FcγRIII on mast cells can be triggered by immunoglobulin G (IgG)-antigen immune complexes. (Ref: 23) However, the dissociation constant of IgG for FcγRI and FcγRIII is considerably higher than for IgE bound to FcεRIα, which means that, unlike IgE, IgG is not retained on the mast cell surface. (Ref: 17) Co-aggregation of FcεRI, FcγRI, or FcγRIII with FcγRIIb inhibits mast cell activation, as the intracellular domain of FcγRIIb contains immunoreceptor tyrosine-based inhibitory motifs, which recruit phosphatases that blunt signaling. (Ref: 17) Although FcγRI/III aggregation on mast cells may contribute to anaphylaxis when FcεRI is absent, (Ref: 24) clinical observations from allergy patients treated with the IgE-specific neutralizing antibody Omalizumab (Ref: 25) indicate that, in humans, antigen-dependent mast cell responses are largely mediated through the IgE-FcεRI pathway.\n      Antigen-specific IgE antibodies can be elicited during a type 2 immune response, (Ref: 20) which can occur when antigen crosses tissue barriers. Antigen-presenting cells process the antigen, migrate to draining lymph nodes, and activate helper T cells, (Ref: 20) which differentiate into T helper 2 cells (Th2). Type 2 immunity is also promoted by innate lymphocytes 2 (ILC2). Th2 cells and ILC2s release cytokines (interleukin [IL]-4 and IL-13) that stimulate B cells to undergo isotype-class switching and differentiation into plasma cells producing IgE antibodies (Ref: 20) (Figure 1A). IL-4 is crucial for class switching to IgE, (Ref: 22) whereas IL-13, produced by follicular helper T cells in the germinal center, can facilitate the production of high-affinity IgE antibodies. (Ref: 26) IgE affinity maturation shows a notable convergence of antibody V region sequences and hypermutations, as seen in the high-avidity peanut-specific IgE responses among unrelated individuals. (Ref: 27) Following primary antigen exposure, few IgE+ memory B cells are generated and IgE-producing plasma cells are short-lived. (Ref: 28) However, during repeated antigen exposure, IgG memory B cells can switch to IgE and differentiate into long-lived plasma cells producing high-affinity IgE. (Ref: 28)\n      Although mast cells clearly promote pathology associated with type 2 immunity and allergy, there is evidence that mast cells can mediate protection against noxious substances, i. e., toxins, and allergens via neuroimmune signaling. Despite the well-known close association between mast cells and nerve fibers—which may enable bidirectional communication (Ref: 29)—the scope and implications of interactions between mast cells and the nervous system leading to host protection through behavioral responses has received less attention. In this review, we discuss the communication between mast cells and neurons in host-protective avoidance behavior and expulsion reflexes and present a concept of mast cells as converters of signals from IgE and other stimuli into organ-specific or systemic reflexes. We also address crucial open questions and highlight avenues for future investigations in this rapidly evolving field.",
  "mast_cells—the_hematopoietic_unicorn": "Mast cells are hematopoietic cells strategically located in barrier tissues, which has been taken to suggest that they sense invading pathogens and promote innate immunity. However, unlike other classical immunity cell types—such as macrophages, neutrophils, and eosinophils—mast cells express markedly distinct transcriptomes (Ref: 15) (Ref: 30) (Ref: 31) (Ref: 32) and proteomes, (Ref: 33) and they lack broad pattern recognition receptor expression. (Ref: 30) (Ref: 33) Although there is evidence for a contributing role of IgE-mediated mast cell activation in adaptive immunity (Ref: 34) and defense against venom toxicity, (Ref: 35) (Ref: 36) there are no immunodeficiencies in the absence of IgE and mast cells. (Ref: 37) Thus, questions remain as to whether classical immunological protection—akin, for example, to the functions of neutrophils and IgG antibodies in destruction and neutralization of pathogens—represents a fundamental role of mast cells and IgE. On the other hand, two independent studies (Ref: 38) (Ref: 39) highlight that mast cells and IgE have specific and crucial roles in host-protective behavior. This can be viewed as non-classical immunological protection. The data support the “toxin hypothesis,” (Ref: 40) which proposes that allergic reactions act as a defense mechanism against allergens—antigens that induce immunological sensitization and the production of specific IgE. Sensitization to allergens may occur when barrier integrity is compromised (Ref: 41) due to prolonged or heightened antigen exposure, physical (Ref: 42) or chemical insults (e. g., detergents or solvents (Ref: 43)), or infections. (Ref: 44) Other factors, such as altered microbiome diversity, (Ref: 45) may also contribute to globally rising sensitization rates. Allergens can be innocuous (non-toxic substances) (Ref: 46) or may be toxic via proteolytic properties (e. g., papain from papaya (Ref: 47) or Der p 1 from house dust mites (Ref: 48)). Repeated exposure to innocuous allergens, often found in occupational environments, can lead to persistent inflammatory responses. Expulsion and avoidance behaviors may hence protect the host not only from futile inflammation and immunopathology induced by harmless allergens but also in mitigating damage when toxic allergens are encountered.\n      Understanding these and other neuroimmune functions of mast cells presents a major challenge due to the complexities associated with the specificity and limitations of commonly used experimental tools. The use of Kit-deficient, mast-cell-deficient mice in immunological or behavioral research introduced significant complications. The Kit gene is expressed in multiple cell types beyond mast cells and plays essential roles in the normal function of many lineages, (Ref: 49) (Ref: 50) including several neuronal populations, particularly transient receptor potential cation channel subfamily V member 1+ (TRPV1; the capsaicin receptor) nociceptive neurons. (Ref: 51) Neuronal defects in Kit-mutant mice may explain the anxiety-like behaviors observed in these animals, (Ref: 52) which are not present in Kit-mutation-independent Cpa3Cre/+ mast-cell-deficient mice. (Ref: 38) Thus, prior claims regarding functions of mast cells based on experiments in Kit-deficient mice must be re-evaluated in models with unimpaired Kit function. (Ref: 37) A large body of the literature on mast cells in neuro-immunology is based on work done in Kit mutants. Despite the fact that these data are not definitive, we refer to these reports here as a blueprint for verification. Beyond genetic models, pharmacological experiments using the mast cell “stabilizer” cromoglicic acid (cromolyn) are not specific for mouse mast cells (Ref: 53) but instead inhibit neurons, (Ref: 54) whereas ketotifen, another drug commonly used for mast cell inhibition, (Ref: 55) lacks specificity (Ref: 56) and affects other cell types as well. As a result, conclusions about mast cell functions drawn from studies using these inhibitors require closer scrutiny.",
  "antigen_avoidance": "According to the toxin hypothesis, antigen avoidance can prevent repeated antigen exposure. (Ref: 40) This theory has been extended and broadened in subsequent considerations. (Ref: 46) (Ref: 57) Experimentally, avoidance of dietary antigens has been linked to the immune status, as ovalbumin (OVA)-immunized mice develop aversion to solutions containing OVA, even when sweetened. (Ref: 58) Such food aversion can be reversed by inducing OVA-specific unresponsiveness through oral tolerance (Ref: 58) or transferred to naive mice via passive transfer of serum or spleen cells. (Ref: 59) Studies have elucidated how type 2 immunity drives this avoidance behavior to food allergens. (Ref: 38) (Ref: 39) Immunization-induced OVA avoidance does not occur in mast-cell-deficient Cpa3Cre/+ or mast-cell-depleted Ms4a2DTR (diphtheria toxin receptor [DTR]-expression driven by the FcεRIβ [Ms4a2]-promoter) mice, demonstrating that mast cells link immune sensing to antigen avoidance behavior. (Ref: 38) (Ref: 39) Hence, this is a non-redundant mast cell function. Upstream components of type 2 immunity, IL-4Rα, IgE, and FcεRI, are required for avoidance. Breaking avoidance drives local and systemic inflammation, (Ref: 38) supporting the notion that antigen avoidance protects against continuous and unnecessary immune responses. In summary, type 2 immunity leads to the generation of antigen-specific IgE, which sensitizes mast cells. Upon reencounter of antigen, mast cells function as important sensor cells, detecting OVA via IgE bound to FcεRI and converting the antigen signal to host-protective avoidance behavior (Figure 1A). The loss of avoidance in the absence of mast cells resembles other key deficiencies in an immune system lacking specific cell types, including antibody deficiency in the absence of B cells.\n      Mice sense dietary antigen by mucosal mast cells in the stomach and small intestine. Potential roles for connective-tissue-type mast cells in antigen avoidance need to be addressed in future studies. OVA avoidance can develop rapidly (within minutes), (Ref: 38) (Ref: 39) a time frame compatible with neuronal transmission of avoidance signals from the gut to the brain. Possible neural pathways in the gut involve neurons of the enteric nervous system, along with mucosal endings of vagal ganglion (VG) and dorsal root ganglion (DRG) sensory neurons (Ref: 60) (Figure 1B). However, luminal antigen stimulation in gut tissues of OVA-immunized mice does not trigger activation in enteric neurons (Ref: 38) and avoidance behavior remains unaffected by surgical vagotomy, (Ref: 38) (Ref: 39) suggesting that avoidance signals are transmitted independent of enteric and vagal neurons. Antigen sensing in the gut can be transmitted to DRG neurons, as luminal antigen exposure in immunized rats induces action potentials in mesenteric nerve bundles. (Ref: 61) Oral antigen challenge of food-sensitized mice results in mast-cell-, IgE-, and histamine 1 receptor (H1R)-dependent nociception upon intestinal distension and augmented activation of splanchnic nerves following mechanical stimulation of the mucosa. (Ref: 44) Both mesenteric nerve bundles and splanchnic nerves contain gut-innervating DRG neurons, which include both TRPV1+ and TRPV1− subsets. Given that avoidance is not affected by the systemic depletion of TRPV1+ neurons, (Ref: 38) (Ref: 39) the possibility remains that DRG neurons lacking TRPV1 signal avoidance to the central nervous system (CNS). Alternatively, the entire enteral innervation may not be involved.\n      Genetic or pharmacological blockade of histamine, serotonin, substance P, and mast cell proteases (Cpa3, Mcpt5, and Mcpt6) does not impair avoidance. Inhibition of leukotriene synthesis (inhibitors Zileuton, MK-886, and leukotriene C4 synthase Ltc4s−/−) or blockade of the leukotriene C4-receptor, cysteinyl leukotriene receptor 2 (CysLT2R), interferes with antigen avoidance. (Ref: 38) (Ref: 39) Hence, leukotriene C4 and its receptor appear to be involved in the avoidance signal. Leukotriene signaling through CysLT2R initiates the itch reflex in the skin, (Ref: 62) (Ref: 63) and mast cells may initiate avoidance through a similar pathway in the gut. Moreover, fast-acting circulating humoral factors released following antigen exposure could transmit avoidance signals to the brain. Growth/differentiation factor 15 (GDF15) is rapidly induced by antigen challenge downstream of mast cells and leukotrienes. (Ref: 39) Injection of a GDF15-blocking antibody in OVA-immunized mice does not interfere with avoidance behavior immediately (day 1) but on day 2 of antigen exposure. (Ref: 39) The necessity for leukotriene signaling via CysLT2R during the initial phase of avoidance raises the possibility of first, GDF15-independent, avoidance signal(s). Subsequently, mast-cell-induced GDF15 could sustain avoidance and may also cause conditioning. The roles of both leukotrienes and GDF15 in antigen avoidance require further study. In addition to avoidance, GDF15 is a humoral molecule known to contribute to conditioning in taste aversion experiments. (Ref: 64) (Ref: 65) In this context, it was observed that immunized rats exposed to conditioning, where antigen stimulation is paired with external (audio-visual) cues, release mucosal mast cell protease into the bloodstream in response to the conditioned stimulus. (Ref: 66) This suggests that remembering antigen exposure may be sufficient to trigger mast cell activation and avoidance behavior, even in the absence of the actual antigen. (Ref: 66) The insular cortex region of the brain is known to store memories, and it is intriguing to speculate that these include “allergic memories” and other memories of specific immune responses. (Ref: 67) Further evidence supporting a connection between avoidance and conditioning comes from studies of allergic asthma. OVA-inhalation challenge of OVA-sensitized mice leads to an IgE-dependent avoidance of the chamber where the challenge took place, even in the absence of OVA, (Ref: 68) (Ref: 69) and pairing of antigen inhalation with a neutral cue in asthma patients causes allergic reactions in response to the cue. (Ref: 70) However, there is no evidence that mast-cell-mediated avoidance is a result of conditioning. In fact, when given the free choice, mice that are actively avoiding do not completely abstain; instead, they continuously sample small quantities of antigen-containing water. (Ref: 38) This small amount of antigen signal, which is below a pathogenic threshold, may constantly renew the avoidance behavior. Hence, any link between avoidance and conditioning is likely complex. Future studies should investigate whether avoidance mechanisms in the airways are similar to mast-cell-dependent avoidance of ingested antigens and clarify the link between avoidance behaviors and conditioning.",
  "ige-activated_mast_cells_in_itch,_tearing,_sneezing,_cough,_diarrhea,_and_emesis": "Itch (pruritus) is a sensation that elicits the urge to scratch, a reflex thought to protect the body by removing harmful allergens and parasites from the skin surface. (Ref: 40) (Ref: 71) Active and passive immunization of mice against OVA, followed by intradermal injection of OVA, leads to scratching behavior. (Ref: 62) This response is reduced in Kit-mutant mice, hence mast cells may detect injected OVA through specific IgE and transmit this antigen signal to neurons, resulting in itch. IgE may also play a role in heat nociception. (Ref: 72) (Ref: 73) The skin is innervated by sensory neurons with cell bodies situated in the DRG and, in the case of the skin covering the head, within the trigeminal ganglia (TG) (Ref: 71) (Figure 1B). Histamine is a key pruritogen released from IgE-activated mast cells that, when injected alone, can induce itch in both mice and humans. (Ref: 71) IgE-mediated activation of dermal mast cells induces activation of DRG neurons that could be blocked by H1R and H4R antagonists. (Ref: 74) These same neurons also responded to direct intradermal injections of histamine and capsaicin, indicating that mast cell products trigger neuron subsets characterized by expression of TRPV1 and H1R/H4R. (Ref: 74) All three receptors are expressed on the NP2/NP3 subtypes of DRG neurons, which, based on their responsiveness to stimulation, as well as protein and RNA expression profiles, are itch neurons. (Ref: 71) (Ref: 75) Collectively, the data support a model in which histamine released by IgE-activated mast cells stimulates H1R/H4R receptors on NP2/NP3 DRG neurons, signaling itch to the CNS, which may underlie allergic itch. The potential roles of neuron-expressed FcεRI (Ref: 76) and mast-cell-independent histamine sources, such as basophils (Ref: 10) and neutrophils, (Ref: 77) in antigen-induced itch require further investigation.\n      Tearing, which can be triggered by allergic reactions such as allergic conjunctivitis, (Ref: 78) may serve a protective function by aiding removal of antigens from the eye. (Ref: 40) Experimental evidence in both mice and humans supports a role of mast cells in antigen-induced tearing. When the eyes of allergic conjunctivitis patients are exposed to antigen, increased tearing, conjunctival redness, and itching occur within 5 min. (Ref: 78) Over half of the patients show increases in histamine levels in their tear fluid after antigen challenge, indicating histamine release, potentially from mast cells. (Ref: 78) In mice, active immunization against ragweed, followed by application of ragweed on the eye’s surface, leads to multiple inflammatory reactions, including tearing. (Ref: 79) This response is reduced in Kit-mutant mice. (Ref: 79) Tearing can be induced by TG sensory neurons that innervate the eye (Ref: 80) (Figure 1B). TG neurons exhibit molecular characteristics similar to DRG neurons, notably the expression of H1R. (Ref: 81) Existing data support a model in which histamine released from IgE-activated mast cells triggers TG neuron activation, rapidly leading to tearing.\n      Sneezing, a common allergic symptom in the upper airways—for example, in hay fever or allergic rhinitis—may serve a protective function by expelling antigens from the nasal cavity. (Ref: 40) Two recent studies provide evidence for the involvement of mast cells in the sneezing reflex. (Ref: 82) (Ref: 83) Intranasal OVA challenge of antigen-sensitized mice induces pronounced sneezing, a response abrogated in Kit-mutant mice. (Ref: 82) Similar to the conjunctiva, the nasal epithelium is innervated by TG sensory neurons (Figure 1B). Genetic ablation of a subset of TG neurons, marked by MrgprC11 expression, abolishes sneezing responses to aerosolized histamine, 5-HT, or neuropeptide FF (NPFF). (Ref: 83) NPFF can be released from mast cells upon activation. (Ref: 84) In a mouse model of allergic rhinitis, depletion of MrgprC11+ (Ref: 83) or TRPV1+ neurons (Ref: 82) abrogated allergen-triggered sneezing responses. MrgprC11 and TRPV1 are co-expressed by a specific population of nose-innervating TG neurons. (Ref: 83) Hence, mast cells can detect antigen in the nasal mucosa and convert antigen signals into secreted mediators acting in concert to stimulate MrgprC11+ TRPV1+ TG neurons, which induces sneezing.\n      Coughing, which can be associated with allergic reactions, may protect the lower airways by expelling antigens. (Ref: 40) Guinea pigs have been extensively used to study allergic cough, primarily due to their respiratory physiology, which bears similarities to humans, and their heightened sensitivity to tussive (cough-inducing) stimuli. (Ref: 85) Guinea pigs immunized with OVA and alum, and subsequently challenged with OVA inhalation, cough, which depends on signaling through H1R (Ref: 86) and TRPV1. (Ref: 87) Whereas the respiratory tract is innervated by VG and DRG sensory neurons (Figure 1B), mast cell mediators may stimulate only a subset (TRPV1+ SST+) of VG neurons, akin to chemical-induced cough. (Ref: 83) From these neurons, signals are transmitted to the brainstem, initiating the cough event. (Ref: 88) Coughing commences with the concerted relaxation and contraction of airway muscles, (Ref: 88) and mast cells are also involved in this phase of coughing. Isolated trachea from OVA-immunized wild-type mice exhibit rapid and short-lived muscle contraction upon OVA exposure, which could be replicated by stimulation with 5-HT (Ref: 89) that can be secreted from airway mast cells. (Ref: 90) Antigen-induced contractions are inhibited by ketanserin, a 5-HT2 receptor antagonist. (Ref: 89) (Ref: 90) Trachea isolated from immunized Kit-mutant mice do not contract following antigen stimulation, (Ref: 89) a phenotype also reported in mast-cell-deficient Cpa3Cre/+ mice. (Ref: 90) Airway muscle contractions are controlled by cholinergic neurons of the parasympathetic nervous system. (Ref: 91) In support of this mechanism, antigen-induced tracheal contractions are inhibited by atropine, an inhibitor of muscarinic acetylcholine receptors. (Ref: 89) Moreover, intracellular recordings of parasympathetic neuron membrane potential in mouse tracheal ganglia demonstrate a ketanserin-sensitive depolarization triggered by 5-HT, along with a similar response elicited by OVA challenge. (Ref: 89) Collectively, these studies suggest that mast cells and their mediators are involved in both induction and execution of the cough reflex, with the strongest evidence of a role for mast-cell-derived 5-HT signaling to cholinergic parasympathetic neurons during the airway contraction phase. In contrast, evidence for mast cell dependency in the initiation of cough through triggering of sensory neurons following antigen inhalation appears less conclusive.\n      Diarrhea and vomiting can be triggered by allergic reactions in the gastrointestinal tract, commonly known as food allergies, and may serve a protective function by expelling ingested antigens and gastrointestinal parasites. (Ref: 40) In mice, mast cells have been linked to antigen-induced diarrhea. Immunization with OVA and alum, followed by repeated OVA gavage, results in diarrhea, a response that can be prevented by IgE-neutralization, (Ref: 92) anti-Kit-antibody-mediated mast cell depletion, (Ref: 92) and genetic mast cell deficiency (Cpa3Cre/+ mice). (Ref: 38) Antigen-induced diarrhea is also suppressed by antagonizing a combination of serotonin and platelet-activating factor (PAF) signaling, (Ref: 92) suggesting involvement of these mast-cell-expressed mediators. The precise mechanisms through which mast cells contribute to diarrhea remain uncertain. Diarrhea occurs when chloride (Cl−) ions and water are lost through the epithelial barrier into the gut lumen. (Ref: 92) (Ref: 93) (Ref: 94)In vitro antigen stimulation of intestinal tissue segments excised from immunized mice increases short-circuit currents (indicative of Cl− secretion), which are diminished in Kit-mutant mice. (Ref: 95) Hence, mast-cell-activation-induced epithelial Cl− secretion may be part of the mechanism. In mouse models of food allergy, multiple oral antigen challenges are required to induce diarrhea, (Ref: 38) (Ref: 92) conditions that also produce gut inflammation. (Ref: 38) (Ref: 39) (Ref: 92) Therefore, inflammation-driven changes in the gut may be involved in mast-cell-induced diarrhea; however, the precise cellular and molecular pathways downstream of mast cells contributing to inflammation and diarrhea in food allergy remain incompletely understood.\n      Vomiting (emesis), typically accompanied or preceded by nausea, is the forceful expulsion of stomach and intestinal contents through the mouth. (Ref: 96) There is evidence for the contribution of IgE and mast cells to vomiting; however, mechanistic experiments are complicated by rodents’ inability to vomit. (Ref: 96) Emetic species such as house musk shrews (Suncus murinus) and common marmosets (Callithrix jacchus) exhibit profound vomiting upon oral administration of the bacterial superantigenic toxin staphylococcal enterotoxin type A (SEA). (Ref: 97) (Ref: 98) SEA binds to submucosal mast cells in the gut and triggers their degranulation (i. e., loss of metachromatic staining) and histamine release from the intestine. (Ref: 97) (Ref: 98) However, SEA can also activate immune cells other than mast cells. Vagotomy or pharmacological blockade of H1R and 5-HT3 receptors prevents emesis. (Ref: 97) (Ref: 98) This suggests that mast cells could be activated by SEA, which may trigger vomiting via 5-HT3 receptors on gut-innervating vagal sensory neurons. A secondary line of experimentation linking mast cells to vomiting involves studies in mice that, even though non-emetic, display pica behavior; i. e., they ingest nonfood substances, like kaolin, following emetic stimulation. (Ref: 99) Systemic administration of GDF15, which is a stress-response cytokine that activates glial-derived neurotrophic factor receptor alpha-like (GFRAL) on brainstem neurons, (Ref: 96) induces emesis in musk shrews and triggers pica behavior in mice. (Ref: 64) In a mouse model of food allergy, OVA-sensitization and intragastric OVA challenge induce a rapid (within 1 h) increase in systemic GDF15 levels, which is further elevated upon successive OVA challenges. (Ref: 39) Mice deficient in IgE or mast cells do not show this systemic GDF15 increase, even following multiple gavages. (Ref: 39) Taken together, mast cells and IgE may promote emesis and pica independent of the vagus nerve, which may involve the GDF15-brainstem-GFRAL pathway.\n      In summary, itching, tearing, sneezing, coughing, diarrhea, and vomiting are host-protective reflexes. These responses can be rapidly initiated by tissue mast cell sensing of antigen through IgE, and subsequent signaling to neural cells, transmitting the information to the CNS. Hence, in this scenario, mast cells act as converters of antigen signals into host-protective reflexes. Mast cell products and their receptors on sensory neurons are depicted in Figure 1C. For example, antigen sensing by mast cells can trigger the release of serotonin and histamine, which have specific receptors on neurons (Figure 1C). Different tissues receive distinct neural innervation (Figure 1B), which, together with distinct mast cell phenotypes, likely imparts tissue-specificity of allergic reflexes. Clearly, the repertoire of mast-cell-derived neuroactive mediators requires further study.",
  "anaphylaxis_as_host_protection?": "The discovery of anaphylaxis (Ref: 100) was a founding event in immunology, yet, to this date, the physiological “purpose” of this drastic form of hyperreactivity remains obscure. In nature, snake or arthropod envenomation can cause venom to spread throughout the body, which can trigger systemic mast cell activation, potentially leading to anaphylaxis. Anaphylaxis accompanies the release of mast cell proteases, which can degrade venom toxins. (Ref: 101) (Ref: 102) Although carrying inherent risks, it has been proposed that non-fatal anaphylaxis may confer protection by mitigating the effects of envenomation. (Ref: 103) Systemic injection of antigen into IgE-sensitized mice causes IgE-mediated mast cell degranulation and rapid hypothermia, a response that is completely abrogated in mast-cell-deficient Cpa3Cre/+ mice. (Ref: 14) High-affinity IgE-antigen interactions lead to mast cell activation and robust mast cell mediator release in vitro. (Ref: 104) This high-affinity binding serves as a key signal for both local (Ref: 104) and systemic (Ref: 26) anaphylaxis in vivo. In addition, factors such as antigen concentration and avidity (Ref: 105) of IgE-antigen interactions may also play a role. Future studies should explore the physiological roles of high- versus low-affinity IgE in regulating mast cell function and physiological outcomes.\n      Anaphylaxis is accompanied by hypothermia and hypotension, which are clinical hallmarks. Activation of neurons downstream of mast cells is thought to drive this reduction of body temperature. (Ref: 106) Anaphylaxis-induced hypothermia is reduced in TRPV1-deficient mice, and selective activation of TRPV1+ sensory neurons is sufficient to induce hypothermia. (Ref: 106) This suggests that mast cells induce TRPV1+ neurons to promote hypothermia. Deficiency of the chymase Mcpt4, or pharmacological blockade of protease-activated receptor 1 (PAR1; a target of Mcpt4) reduces hypothermia. (Ref: 106) Hence, the results are in agreement with a model in which IgE-activated mast cells promote hypothermia via Mcpt4-PAR1 signaling to TRPV1+ sensory neurons. In the context of host protection, one could speculate that anaphylaxis-triggered hypothermia and hypotension reduce the metabolic rate as well as the systemic spread of toxins.",
  "mrgprb2:_a_ligand-versatile_receptor_sensing_tissue_insults_expressed_by_mast_cells": "Mast cells express cell surface receptors beyond those for IgE, which are capable of sensing signals released during tissue insults and stress, e. g., in the course of infection, inflammation, or injury (Figure 2A). The most ligand-versatile receptor capable of recognizing many different, mostly positively charged, endogenous and exogenous compounds (Ref: 107) (Ref: 108) is the Mas-related G-protein-coupled receptor B2 (Ref: 109) (MrgprB2; in humans MRGPRX2 (Ref: 110)). MrgprB2 is expressed in connective-tissue-type mast cells but not in mucosal mast cells. (Ref: 15) Endogenous ligands include host-defense peptides (e. g., cathelicidins such as LL-37), neuropeptides (including substance P and somatostatin), and peptide hormones such as proadrenomedullin N-terminal 12 peptide (PAMP12), pituitary adenylate cyclase activating peptide (PACAP), and corticotropin-releasing factor (CRF), (Ref: 107) (Ref: 108) all of which can be induced during cell stress, infection, or inflammation. Exogenous MrgprB2 ligands include the widely used artificial MrgprB2 ligand compound 48/80 (C48/80), (Ref: 109) arthropod venom peptides (e. g., mastoparan), and microbial products (such as quorum-sensing molecules and competence-stimulating peptides). C48/80 can activate mast-cell-like “test cells” in Styela plicata, (Ref: 9) suggesting that MrgprB2-mediated mast cell sensing represents a primordial function.\n      Binding of ligands to the extracellular domains of MrgprB2 induces conformational changes in the receptor, resulting in canonical activation of G-protein-signaling pathways. (Ref: 111) Certain ligands with a distinct binding mode may activate both G proteins and the β-arrestin signaling pathway, potentially leading to divergent responses. (Ref: 111) A further level of complexity arises from the fact that the Mrg receptor family consists of 22 members with considerable sequence and structural similarities. (Ref: 108) For example, MrgprB2 ligand’s substance P, C48/80, and potentially others, can also activate MrgprA1, (Ref: 112) which is expressed by dendritic cells, (Ref: 113) neutrophils, (Ref: 114) and various subsets of DRG neurons. (Ref: 75) Hence, rather than mast-cell-expressed MrgprB2, MrgprA1 activation on immune cells might account for the adjuvant effect attributed to C48/80, (Ref: 115) whereas neuronal expression of MrgprA1 may explain the ability of C48/80 to directly stimulate DRG neurons in culture. (Ref: 54) (Ref: 116) Given the complexities arising from many different ligands, divergent ligand binding modes, and the expression of structurally similar Mrg receptors across different cell types, it will be important to disentangle the mast-cell-dependent and mast-cell-independent roles of Mrgpr activation in tissues.\n      An example of mast cell sensing of tissue damage through MrgprB2 is seen after cutaneous exposure of mice to a combination of house dust mite allergen extract and staphylococcal enterotoxin B, which induces atopic dermatitis (AD)-like skin inflammation. (Ref: 117) Mice deficient in mast cells (Cpa3-Cre Mcl1fl/fl), or lacking MrgprB2 or substance P (Tac1−/−), are protected from AD-like inflammation. Substance P expression is restricted to skin innervating TRPV1+ neurons, and ablation of these neurons protects mice from inflammation. (Ref: 117) A further example of how the MrgprB2-substance P axis may contribute to inflammation is diabetes, which is associated with increased substance P expression in TRPV1+ DRG neurons in the skin. (Ref: 118) Again, neuron-released substance P activates mast cells via MrgprB2, causing impaired blood flow in the skin microvasculature. (Ref: 118) Collectively, these studies support a model in which TRPV1+ sensory neurons secrete substance P, which subsequently activates mast cells through MrgprB2, ultimately leading to skin inflammation and vascular leakage (Figure 2B).",
  "mast_cell_sensing_of_tissue_insults_promotes_nociception,_pain,_and_itch": "A symptom of inflammation is nociception and pain, (Ref: 119) a reflex with possible mast cell involvement. For the occurrence of pain, which is defined as “an aversive sensory experience caused by actual or potential injury that elicits protective motor and vegetative reactions,” (Ref: 120) nociceptive neurons innervating the barrier tissue must be stimulated to convey the sensation to the CNS (i. e., nociception). Analogous to innervation patterns governing allergic reflexes, skin and bladder tissues are innervated by DRG neurons whereas the meninges are innervated by TG neurons (Figure 2C). Pain in animal models is assessed by measuring protective motor and avoidance responses, e. g., by observing withdrawal of rodent paws following thermal or mechanical stimulation.\n      MrgprB2-dependent mast cell activation in the skin, initiated by stress- or damage-associated molecules released during injury or inflammation, could play a role in nociception. Injection of mice with complete Freund’s adjuvant (CFA; consisting of a blend of mineral oil and heat-killed Mycobacterium tuberculosis) triggers mechanical and thermal hyperalgesia (increased sensitivity to noxious stimuli) along with robust inflammation and the release of damage-associated molecules and neuropeptides, including substance P. (Ref: 121) However, mast cell involvement in CFA nociception is controversial. CFA pain is reduced in Kit-mutant mice, (Ref: 122) and in mice where MrgprB2-expressing cells are ablated via diphtheria toxin injection (MrgprB2-Cre ROSA26iDTR [inducible DTR] mice), (Ref: 121) but remains unaffected in mast-cell-depleted Mcpt5-Cre ROSA26iDTR mice. (Ref: 116) Nociceptive defects in Kit-mutant mice (Ref: 51) and the expression of MrgprB2 outside of the mast cell lineage (Ref: 123) may underly the observed CFA pain inconsistencies. Nevertheless, a substance-P-MrgprB2-mast-cell axis in nociception may function in a mouse model of post-operative (i. e., incision-induced) pain. Skin incision rapidly induces substance P release as well as mechanical and thermal hypersensitivity in wild-type mice, which is abrogated in MrgprB2-deficient mice, (Ref: 121) in mast-cell-deficient Mcpt5-Cre ROSA26DTA (diphtheria toxin alpha) mice, (Ref: 124) and in mice with 5-HT-deficient mast cells. (Ref: 124)\n      CFA injection and skin incision can enhance the sensitivity of nociceptive neurons to mast cell mediators, which may lower the threshold for host-protective reflexes. However, even under non-inflammatory conditions, activation of skin mast cells by injection of MrgprB2 ligands may induce pain and itch. For instance, C48/80 injected into the skin causes thermal and mechanical hyperalgesia in naive wild-type mice, a response that is abrogated in Kit-mutant mice. (Ref: 125) Furthermore, injection of C48/80 and PAMP12 induces itch in wild-type, but not in MrgprB2−/−, mice. (Ref: 74) However, the dependency of MrgprB2-induced itch on mast cells remains unclear, as studies with Kit-mutant mice show inconsistent results, with some reporting reduced itch (Ref: 74) and others normal levels of itch. (Ref: 126) (Ref: 127) Clarifying the specific role of MrgprB2 and mast cells will require further investigation using mast-cell-specific tools. Nevertheless, in a gain-of-function experiment, IgE-independent activation by clozapine-n-oxide (ligand for hM3Dq) of skin mast cells by the genetically introduced artificial G-protein-coupled designer receptor hM3Dq (Mcpt5-Cre CAG-LSL-hM3Dq) causes itch, (Ref: 128) suggesting that mast cell activation via G-protein-coupled receptors is sufficient to induce itch. Thus, skin mast cells may trigger host-protective pain and itch, even in the absence of overt inflammation.\n      Beyond skin, MrgprB2-activation of meningeal mast cells may promote pain. Both repeated restraint stress and alcohol withdrawal in mice induces systemic increases in PACAP (Ref: 129) and CRF (Ref: 130) levels, respectively, and facial mechanical hypersensitivity similar to migraine headaches. PACAP- and CRF-induced pain is diminished in MrgprB2−/− animals, (Ref: 129) (Ref: 130) (Ref: 131) suggesting that both PACAP and CRF mediate their effects via this receptor. Alcohol withdrawal induces tumor necrosis factor alpha (TNF-α), a mediator produced by mast cells, (Ref: 132) in the dura mater of wild-type, but not MrgprB2−/−, animals. (Ref: 130) Pharmacological inhibition of TNF receptor or TRPV1 following restraint stress or alcohol withdrawal reduces mechanical hyperalgesia. (Ref: 129) (Ref: 130) Dural injection of PACAP or CRF increases spontaneous as well as mechanical and capsaicin-driven TG neuron activity. (Ref: 129) (Ref: 130) Hence, the stress-response mediators PACAP and CRF may induce MrgprB2-mediated activation of meningeal mast cells, subsequently eliciting mechanical hyperalgesia through TRPV1+ TG neurons. However, formal proof for a role of mast cells is lacking.\n      MrgprB2 activation of bladder mast cells may contribute to pain. Injection of LL-37 into the bladder, which activates MrgprB2 on mast cells, induces mechanical hyperalgesia—a response reduced in Kit-mutant mice. (Ref: 133) Furthermore, repeated bacterial urinary tract infections in Kit-independent mast-cell-deficient mice (Mcpt5-Cre ROSAiDTR mice) lead to reduced mechanical hyperalgesia in the pelvic area surrounding the bladder. (Ref: 134) In this infection model, substance P+ neurons accumulate in the bladder and Trpv1-deficiency or pharmacological inhibition of histamine or bradykinin prevents hyperalgesia. Instilling histamine or bradykinin into the bladder is sufficient to induce pain in naive wild-type mice. (Ref: 134) In support of mast-cell-independent bladder pain, MrgprB2 transcripts are expressed in the bladders of Kit-mutant mice, and bladder smooth muscle contractility is similar in both wild-type and Kit-mutant mice following C48/80 instillation. (Ref: 123) This suggests that non-mast-cell-expressed MrgprB2 may also play a significant role in bladder function and points to a broader involvement of MrgprB2 beyond mast cells. Together, these findings suggest that mast-cell- and non-mast-cell-expressed MrgprB2 contributes to bladder pain and contractility.\n      Overactivity of the mast-cell-MrgprB2 axis in the inflammation and pain pathway could lead to autoimmune-like pathology, highlighting a need for regulatory mechanisms to control it. One such mechanism involves nonpeptidergic MrgprD+ neurons in the skin that reduce mast cell responsiveness to MrgprB2 ligands through the release of glutamate. (Ref: 135) Genetic depletion of MrgprD+ neurons increases C48/80-mediated mast cell degranulation, and administration of the MrgprD agonist, β-alanine, which enhances the excitability of MrgprD+ neurons and their production of glutamate, suppresses C48/80-induced mast cell responses. (Ref: 135) Genetic reduction of glutamate release from MrgprD+ neurons, or pharmacological blockade of the glutamate receptor GluK2 (GluR6), also increases C48/80-mediated mast cell degranulation. (Ref: 135) Hence, glutamate released from MrgprD+ neurons may serve as a mechanism to continuously suppress skin mast cell activation and maintain tissue homeostasis (Figure 2D).\n      Trauma, tissue damage, and inflammation induce complement components C3a/C5a, (Ref: 136) endothelin-1 (ET-1), (Ref: 137) ATP, (Ref: 138) or IL-33 (Ref: 139) (Figure 2A), all of which are also implicated in pain hypersensitivity. Binding of C3a/C5a and ET-1 to their specific G-protein-coupled receptors C3aR/C5aR (Ref: 140) and ETA receptor (Ref: 141) on mast cells results in degranulation. Although direct evidence linking mast cell activation via C3a/C5a or ET-1 to pain and nociception is lacking, several experiments suggest a connection. In mice, hind paw incision nociception correlates with increased skin C5a levels, and pharmacological inhibition of C5aR1 alleviates hyperalgesia. (Ref: 136) Moreover, injection of purified C3a or C5a is sufficient to induce mechanical and thermal hyperalgesia, (Ref: 142) suggesting a contribution of mast cells to nociception via the C5a-C5aR1 axis. Similarly, paw injection of ET-1 results in ETA-receptor-dependent paw licking (indicative of overt pain) as well as thermal hyperalgesia. (Ref: 143) Pharmacological blockade of ETA receptors alleviates both mechanical and thermal hyperalgesia in the CFA model. (Ref: 144) These findings suggest a potential contribution of mast cells to nociception through the ET-1-ETA receptor axis. Degranulation via ET-1 induces the secretion of carboxypeptidase A3 from mast cells, which then proteolytically inactivates ET-1, (Ref: 102) representing a specific, most likely local, ET-1-degrading mechanism of yet unknown physiological significance.\n      Mast cells can detect alarmins like ATP and IL-33 through the P2RX7 (Ref: 138) ion channel and ST2 (IL-33R), (Ref: 145) respectively. In healthy tissues, extracellular nucleotide concentrations—particularly ATP—are typically low, but they can increase in inflamed tissues. (Ref: 138) ATP-mediated mast cell degranulation is associated with pain in two studies. Injection of high concentrations of ATP into mouse skin induces mechanical hyperalgesia, a response that is reduced in Kit-mutant mice and prevented by blocking P2RX7 receptors. (Ref: 146) Using an ex vivo model to record TG neuron activity, ATP application to the meninges activates TG neurons. This activation is diminished in tissues from Kit-mutant mice or when a serotonin receptor 3 (5-HT3R) antagonist is applied. (Ref: 147) Together, these findings may indicate that ATP-activated mast cells contribute to pain.\n      The IL-33 receptor, ST2, is not only expressed by mast cells but also on various other cells—including Th2 cells, type 2 innate lymphoid cells, eosinophils, and basophils. Hence, the specific role of mast cells in IL-33 signaling remains complex. In mast cells, IL-33 does not induce degranulation but instead promotes the production of cytokines such as IL-13 (Ref: 148) and IL-6. (Ref: 149) Mast-cell-derived IL-13 may lower the activation threshold of sensory neurons, thereby enhancing itch (Ref: 148) and pain (Ref: 150) responses. Similarly, IL-6 not only lowers neuronal activation thresholds but can also directly induce pain. (Ref: 151) Following injection of IL-33, mast-cell-derived IL-6 may contribute to mechanical hyperalgesia of the skin. (Ref: 152) Furthermore, injection of antigen into immunized mice induces mechanical hyperalgesia, which can be blocked by pre-treatment with soluble ST2, which acts as a decoy receptor for IL-33. (Ref: 152) However, mast cells can also produce soluble ST2 (Ref: 153) and induce IL-33 release from neighboring epithelial cells. (Ref: 154) Further research is needed to clarify the role of mast cells in IL-33 pain regulation.\n      In response to tissue insults, mast cell activation—through receptors such as MrgprB2, C5aR, ETAR, P2RX7, and ST2—is likely involved in nociception, pain, and itch via signaling through sensory neurons. However, the specific roles and mechanisms by which mast cells and their mediators contribute to these processes are complex and, in part, controversial, highlighting the need for further investigation.",
  "conclusions_and_outlook": "Mast cells are strategically located within barrier tissues and can detect a vast array of foreign antigens through IgE as well as signals released during tissue insults and stress via the ligand-versatile receptor MrgprB2, the IL-33-receptor ST2, and others. There is experimental evidence for mast cells receiving immunological and tissue signals and relaying them to cells from the nervous system. Remarkably, mast cells link immune sensing to antigen avoidance behavior. More generally, in host-protective reflexes, mast cell sensing is converted into messenger molecules, akin to neurotransmitters (Figure 3). Sensory neurons respond to mast cell signals and generate electrical output (action potentials), relaying the information from mast cells to the CNS. There, the signals are decoded to elicit host-protective behavioral responses. Organ specificity of these responses could be achieved by distinct tissue innervation patterns as well as tissue-specific mast cell phenotypes. In this model, mast cells act as converters of antigen and tissue-insult signals to neuronal output (Figure 3). In contrast to afferent signaling, mast cells can also receive stimuli originating from the nervous system and relay them into tissues, for example, during inflammation. In both axes, mast cells would be crucial sensor cells. Further experiments will be needed to dissect such mast cell functions and to explore whether they are non-redundant.\n      Regarding the mechanism underlying mast-cell-mediated avoidance of antigen-containing foods, future research shall elucidate the gut-brain signaling pathways. Furthermore, putative avoidance pathways in the airways are of great interest. Although initial studies have suggested neuroimmune mechanisms of IgE-dependent behavioral reflexes involving mast cells, including itch, tearing, sneezing, cough, diarrhea, and emesis, many questions remain. Key areas include the identification of the mediators produced by mast cells that drive reflexes—and the neural cells responding to these mediators. Mast cell activation leads to the simultaneous release of various classes of mediators, each potentially possessing distinct stimulatory activities toward neurons. (Ref: 155) This is complicated by the fact that mediators that activate mast cells in response to tissue injury can also directly stimulate sensory neurons. Therefore, future research should aim to disentangle the effects of individual mediators and their cooperative interactions, both locally within tissues and at the systemic level. Data on IgE-independent mast cell activation in nociception is also rapidly emerging. It has been long known that IgE-dependent and -independent mast cell activation differs in kinetics and release of mediators. (Ref: 74) (Ref: 156) (Ref: 157) However, the biological meaning of these divergent responses remains unclear. Neurons contain distinct types of intracellular vesicles, such as synaptic vesicles and dense-core granules, which store specific neurotransmitters and are released in a stimulus-dependent manner. (Ref: 158) A similar layer of secretion regulation may operate in mast cells. To fully understand the impact of different mast cell granule species on responses (reflexes) in vivo, it will be critical to more comprehensively understand the conditions dictating potential selective release. Finally, the development of new tools to track mast-cell-neuron interactions in vivo may accelerate our understanding of mast cell functions in host-protective behavior. The future appears bright for the mast cell field as we enter an exciting era of research at the crossroads of immunology and neuroscience.",
  "acknowledgments": "We are grateful to Robin Thiele, Richard Locksley, David Voehringer, Nicolas Gaudenzio, and Christoph Klose for insightful comments on the manuscript. Figures were prepared with Biorender. org. T. B. F. and H.-R. R. received long-term support for mast cell research by former ERC Advanced Grant 233074. H.-R. R. is supported the Leibniz Award of the DFG.",
  "author_contributions": "T. P. and H.-R. R. wrote the manuscript with input from T. B. F.",
  "declaration_of_interests": "The authors declare no competing interests.",
  "figures_(3)": "- 10Citations25CapturesView detailsopens in a new tab",
  "figures": "Figure 1: Mast cell - neuronal pathways in the framework of the toxin hypothesis\n(A) Barrier breach allows for antigen (red dots) uptake by dendritic cells (DC), leading to type 2 immune responses. T helper 2 cells (Th2) are activated, and B cells (B) produce antigen-specific IgE, sensitizing mast cells, which, on reencounter with antigens, promote avoidance via leukotriene C4 (LTC4), Cysteinyl leukotriene receptor 2 (CysLT2R), and GDF15. Heeding avoidance protects mice from antigen-driven intestinal inflammation.\n(B) Innervation of mast cell-bearing tissues with tissue-specific allergic responses that may confer protective reflexes.\n(C) Ligand-receptor pairs connecting IgE-activated mast cells and neurons. NPFF = Neuropeptide FF; PAF = Platelet activating factor; PAR1 = Protease activated receptor 1; H1R/H4R = Histamine receptors 1/4; 5-HT2/3R = Serotonin receptor 2/3; TRPV1 = transient receptor potential cation channel subfamily V member 1; CysLT2R = Cysteinyl leukotriene receptor 2; Mcpt4 = Mast cell protease 4. Question marks indicate lack of data on definitive involvement of receptor-ligand signaling pairs.\n\nFigure 2: Bi-directional intercellular signaling between mast cells and neurons\n(A) Mast cells can be activated by ligation of the following receptors in an IgE-independent manner: complement receptors 3/5 (C3/5aR) by complement components C3a/C5a; ST2 (IL-33R) by interleukin-33 (IL-33); P2X-purinoceptor 7 (P2RX7) by adenosine triphosphate (ATP); or Mas related g-protein coupled receptor B2 (MrgprB2) via substance P, Proadrenomedullin N-terminal 20 peptide (PAMP-12), the Cathelicidin antimicrobial peptide LL-37, pituitary adenylate cyclase activating peptide (PACAP) and corticotropin-releasing factor (CRF), or C48/80. Displayed between mast cells and neurons are ligand-receptor pairs likely that could be involved in mast cell-dependent, but IgE-independent, reflexes, such as in nociception and pain. H1R = histamine receptor 1; 5-HT3R = serotonin receptor 3; Tnfr = tumor necrosis factor receptor; TRPV1 = transient receptor potential cation channel subfamily V member 1; TNFα = tumor necrosis factor alpha, and IL-6 = interleukin-6.\n(B) TRPV1+Tac1+ neurons produce substance P which can activate mast cell-expressed MrgprB2 to induce IgE-independent activation.\n(C) Innervation of mast cell-bearing tissues with tissue-specific IgE-independent responses that may confer protective reflexes.\n(D) MrgprD+ neurons produce glutamate which can activate the metabotropic glutamate receptor GluK2 to inhibit mast cells.\n\nFigure 3: Mast cells as converters of antigen- and tissue- signals into host protective behaviors\nMast cells express FcεRI, FcγRI and FcγRIII, and through IgE and IgG can sense a broad diversity of antigens, representing current immunity, and memory of past B cell immune responses. In addition, mast cells express receptors for sensing signals released during tissue insults and stress, e.g. in the course of infection, inflammation, or injury, including ATP, IL-33, defensins, peptide toxins, complement proteins, neuropeptides, hormones, and endothelin-1. Mast cells can convert these inputs into output signals, akin to neurotransmitters, that are readily detected by sensory neurons. Among the mediators produced by mast cells are histamine, serotonin, leukotrienes, proteases, and cytokines, which can induce action potentials and/or lower the activation threshold of sensory neurons. In this model, electrical signals from neurons are transmitted to the central nervous system that decodes the information and mounts appropriate, organ-specific, host protective behavior.",
  "related_articles_(40)": "- Cost-effective 23.2% efficient germanium thermophotovoltaic converters for thermal batteriesMartín et al.Cell Reports Physical ScienceOctober 8, 2024\n    - Photovoltaic laser power converters producing 21 W/cm2 at a conversion efficiency of 66.5%García et al.Cell Reports Physical ScienceOctober 28, 2024\n    - Integration of renewable energy sources using multiport converters for ultra-fast charging stations for electric vehicles: An overviewSuvvala et al.HeliyonAugust 3, 2024\n    - Multi-junction laser power converters exceeding 50% efficiency in the short wavelength infraredForcade et al.Cell Reports Physical ScienceMay 28, 2025\n    - Non-classical Immunity Controls Microbiota Impact on Skin Immunity and Tissue RepairLinehan et al.CellJanuary 18, 2018\n    - The signal peptide of yeast killer toxin K2 confers producer self-protection and allows conversion into a modular toxin-immunity systemPrins et al.Cell ReportsJuly 9, 2024\n    - Chemical Conversion of Human Fetal Astrocytes into Neurons through Modulation of Multiple Signaling PathwaysYin et al.Stem Cell ReportsFebruary 7, 2019\n    - 3D model for human glia conversion into subtype-specific neurons, including dopamine neuronsGiacomoni et al.Cell Reports MethodsSeptember 4, 2024\n    - Mast Cells Augment Adaptive Immunity by Orchestrating Dendritic Cell Trafficking through Infected TissuesShelburne et al.Cell Host & MicrobeOctober 22, 2009\n    - Sensory Neurons Co-opt Classical Immune Signaling Pathways to Mediate Chronic ItchOetjen et al.CellSeptember 7, 2017\n    - Intraepithelial mast cells drive gasdermin C-mediated type 2 immunityYang et al.ImmunityApril 12, 2024\n    - Nonpeptidergic neurons suppress mast cells via glutamate to maintain skin homeostasisZhang et al.CellMarch 24, 2021\n    - A Connective Tissue Mast-Cell-Specific Receptor Detects Bacterial Quorum-Sensing Molecules and Mediates Antibacterial ImmunityPundir et al.Cell Host & MicrobeJuly 2, 2019\n    - Conversion of Astrocytes and Fibroblasts into Functional Noradrenergic NeuronsLi et al.Cell ReportsJuly 16, 2019\n    - Investigating the impact of discretization techniques on real-time digital control of DC-DC boost converters: A comprehensive analysisYanarateş et al.HeliyonOctober 18, 2024\n    - Enteric neurons and immune cells shape anti-helminth immunityKerner et al.Trends in ParasitologyMarch 20, 2025\n    - Optimal control strategies for high-efficiency non-isolated DC-DC buck converters in IoT applications: A comparative studyKumaraguruparan et al.HeliyonSeptember 19, 2024\n    - Sensory neurons: An integrated component of innate immunityDeng et al.ImmunityApril 09, 2024\n    - Compact transcription factor cassettes generate functional, engraftable motor neurons by direct conversionWang et al.Cell SystemsMarch 13, 2025\n    - Innervation of nociceptor neurons in the spleen promotes germinal center responses and humoral immunityWu et al.CellMay 20, 2024\n    - Converting Immune Cold into Hot by Biosynthetic Functional Vesicles to Boost Systematic Antitumor ImmunityWu et al.iScienceJuly 6, 2020\n    - Proliferation history and transcription factor levels drive direct conversion to motor neuronsWang et al.Cell SystemsMarch 13, 2025\n    - Novel Direct Conversion of Microglia to NeuronsTrudler et al.Trends in Molecular MedicineJanuary 2, 2019\n    - Neurod4 converts endogenous neural stem cells to neurons with synaptic formation after spinal cord injuryFukuoka et al.iScienceJanuary 20, 2021\n    - Generation of Genetically Stable Human Direct-Conversion-Derived Neural Stem Cells Using Quantity Control of Proto-oncogene ExpressionDaekee et al.Molecular Therapy Nucleic AcidsDecember 19, 2018\n    - Measurement system with real time data converter for conversion of I2S data stream to UDP protocol dataVizvari et al.HeliyonApril 9, 2020\n    - Beaming power: Photovoltaic laser power converters for power-by-lightAlgora et al.JouleDecember 28, 2021\n    - Probing the roles of mast cells and basophils in natural and acquired immunity, physiology and diseaseMarone et al.Trends in ImmunologySeptember 01, 2002\n    - Carrier-based sinusoidal pulse-width modulation techniques for flying capacitor modular multi-level cascaded converterOghorada et al.HeliyonDecember 17, 2019\n    - New single-switch buck–boost converter with continuous input/output currents and a wide conversion rangeLotfi-nejad et al.HeliyonAugust 30, 2024\n    - Deconstructing Stepwise Fate Conversion of Human Fibroblasts to Neurons by MicroRNAsCates et al.Cell Stem CellSeptember 21, 2020\n    - Disturbance rejecting PID-FF controller design of a non-ideal buck converter using an innovative snake optimizer with pattern search algorithmErsali et al.HeliyonJuly 13, 2024\n    - Combining Suppression of Stemness with Lineage-Specific Induction Leads to Conversion of Pluripotent Cells into Functional NeuronsHalder et al.Chemistry & BiologyNovember 19, 2015\n    - Design of novel DC-DC interleaved boost converter for BLDC applicationPreethiraj et al.HeliyonNovember 4, 2024\n    - PTBP2 attenuation facilitates fibroblast to neuron conversion by promoting alternative splicing of neuronal genesZhu et al.Stem Cell ReportsOctober 12, 2023\n    - GABAergic signaling between enteric neurons and intestinal smooth muscle promotes innate immunity and gut defense in Caenorhabditis elegansLiu et al.ImmunityJuly 11, 2023\n    - Model predictive control of DC/DC boost converter with reinforcement learningMarahatta et al.HeliyonNovember 5, 2022\n    - Nppb Neurons Are Sensors of Mast Cell-Induced ItchSolinski et al.Cell ReportsMarch 26, 2019\n    - Immunity beyond cancer cells: perspective from tumor tissueGao et al.Trends in CancerJuly 22, 2021\n    - Rapid and Efficient Conversion of Human Fibroblasts into Functional Neurons by Small MoleculesYang et al.Stem Cell ReportsOctober 17, 2019",
  "references": "1. Kitamura, Y. ∙ Shimada, M. ∙ Hatanaka, K. ... Development of mast cells from grafted bone marrow cells in irradiated mice Nature. 1977; 268 :442-443\n2. Gentek, R. ∙ Ghigo, C. ∙ Hoeffel, G. ... Hemogenic Endothelial Fate Mapping Reveals Dual Developmental Origin of Mast Cells Immunity. 2018; 48 :1160-1171.e5\n3. Rodewald, H.R. ∙ Dessing, M. ∙ Dvorak, A.M. ... Identification of a committed precursor for the mast cell lineage Science. 1996; 271 :818-822\n4. Cheng, L.E. ∙ Hartmann, K. ∙ Roers, A. ... Perivascular Mast Cells Dynamically Probe Cutaneous Blood Vessels to Capture Immunoglobulin E Immunity. 2013; 38 :166-175\n5. Stead, R.H. ∙ Tomioka, M. ∙ Quinonez, G. ... Intestinal mucosal mast cells in normal and nematode-infected rat intestines are in intimate contact with peptidergic nerves Proc. Natl. Acad. Sci. USA. 1987; 84 :2975-2979\n6. Undem, B.J. ∙ Taylor-Clark, T. Mechanisms underlying the neuronal-based symptoms of allergy J. Allergy Clin. Immunol. 2014; 133 :1521-1534\n7. Padawer, J. Mast cells: extended lifespan and lack of granule turnover under normal in vivo conditions Exp. Mol. Pathol. 1974; 20 :269-280\n8. Kiernan, J.A. Production and life span of cutaneous mast cells in young rats J. Anat. 1979; 128 :225-238\n9. Cavalcante, M.C.M. ∙ de Andrade, L.R. ∙ Du Bocage Santos-Pinto, C. ... Colocalization of heparin and histamine in the intracellular granules of test cells from the invertebrate Styela plicata (Chordata-Tunicata) J. Struct. Biol. 2002; 137 :313-321\n10. Voehringer, D. Protective and pathological roles of mast cells and basophils Nat. Rev. Immunol. 2013; 13 :362-375\n11. Ehrlich, P. Beiträge für Theorie und Praxis der histologischen Färbung PhD thesis University of Leipzig, 1878\n12. Metcalfe, D.D. ∙ Baram, D. ∙ Mekori, Y.A. Mast cells Physiol. Rev. 1997; 77 :1033-1079\n13. Wernersson, S. ∙ Pejler, G. Mast cell secretory granules: armed for battle Nat. Rev. Immunol. 2014; 14 :478-494\n14. Feyerabend, T.B. ∙ Weiser, A. ∙ Tietz, A. ... Cre-Mediated Cell Ablation Contests Mast Cell Contribution in Models of Antibody- and T Cell-Mediated Autoimmunity Immunity. 2011; 35 :832-844\n15. Tauber, M. ∙ Basso, L. ∙ Martin, J. ... Landscape of mast cell populations across organs in mice and humans J. Exp. Med. 2023; 220, e20230570\n16. Kinet, J.P. The high-affinity IgE receptor (Fc epsilon RI): from physiology to pathology Annu. Rev. Immunol. 1999; 17 :931-972\n17. Tkaczyk, C. ∙ Okayama, Y. ∙ Metcalfe, D.D. ... Fcgamma receptors on mast cells: activatory and inhibitory regulation of mediator release Int. Arch. Allergy Immunol. 2004; 133 :305-315\n18. Rodewald, H.R. ∙ Arulanandam, A.R. ∙ Koyasu, S. ... The high affinity Fc epsilon receptor gamma subunit (Fc epsilon RI gamma) facilitates T cell receptor expression and antigen/major histocompatibility complex-driven signaling in the absence of CD3 zeta and CD3 eta J. Biol. Chem. 1991; 266 :15974-15978 Abstract\n19. Reth, M. Antigen receptor tail clue Nature. 1989; 338 :383-384\n20. Galli, S.J. ∙ Tsai, M. ∙ Piliponsky, A.M. The development of allergic inflammation Nature. 2008; 454 :445-454\n21. Kulczycki, A.J. ∙ Metzger, H. The interaction of IgE with rat basophilic leukemia cells. II. Quantitative aspects of the binding reaction J. Exp. Med. 1974; 140 :1676-1695\n22. Limnander, A. ∙ Kaur, N. ∙ Asrat, S. ... A therapeutic strategy to target distinct sources of IgE and durably reverse allergy Sci. Transl. Med. 2023; 15, eadf9561\n23. Hazenbos, W.L.W. ∙ Gessner, J.E. ∙ Hofhuis, F.M.A. ... Impaired IgG-Dependent Anaphylaxis and Arthus Reaction in FcγRIII (CD16) Deficient Mice Immunity. 1996; 5 :181-188\n24. Oettgen, H.C. ∙ Martin, T.R. ∙ Wynshaw-Boris, A. ... Active anaphylaxis in IgE-deficient mice Nature. 1994; 370 :367-370\n25. Busse, W. ∙ Corren, J. ∙ Lanier, B.Q. ... Omalizumab, anti-IgE recombinant humanized monoclonal antibody, for the treatment of severe allergic asthma J. Allergy Clin. Immunol. 2001; 108 :184-190\n26. Gowthaman, U. ∙ Chen, J.S. ∙ Zhang, B. ... Identification of a T follicular helper cell subset that drives anaphylactic IgE Science. 2019; 365, eaaw6433\n27. Croote, D. ∙ Darmanis, S. ∙ Nadeau, K.C. ... High-affinity allergen-specific human antibodies cloned from single IgE B cell transcriptomes Science. 2018; 362 :1306-1309\n28. Ding, Z. ∙ Mulder, J. ∙ Robinson, M.J. The origins and longevity of IgE responses as indicated by serological and cellular studies in mice and humans Allergy. 2023; 78 :3103-3117\n29. Nakanishi, M. ∙ Furuno, T. Molecular Basis of Neuroimmune Interaction in an In Vitro Coculture Approach Cell. Mol. Immunol. 2008; 5 :249-259\n30. Motakis, E. ∙ Guhl, S. ∙ Ishizu, Y. ... Redefinition of the human mast cell transcriptome by deep-CAGE sequencing Blood. 2014; 123 :e58-e67\n31. Dwyer, D.F. ∙ Barrett, N.A. ∙ Austen, K.F., Immunological Genome Project Consortium Expression profiling of constitutive mast cells reveals a unique identity within the immune system Nat. Immunol. 2016; 17 :878-887\n32. Akula, S. ∙ Paivandy, A. ∙ Fu, Z. ... Quantitative In-Depth Analysis of the Mouse Mast Cell Transcriptome Reveals Organ-Specific Mast Cell Heterogeneity Cells. 2020; 9 :211\n33. Plum, T. ∙ Wang, X. ∙ Rettel, M. ... Human Mast Cell Proteome Reveals Unique Lineage, Putative Functions, and Structural Basis for Cell Ablation Immunity. 2020; 52 :404-416.e5\n34. Starkl, P. ∙ Watzenboeck, M.L. ∙ Popov, L.M. ... IgE Effector Mechanisms, in Concert with Mast Cells, Contribute to Acquired Host Defense against Staphylococcus aureus Immunity. 2020; 53 :793-804.e9\n35. Marichal, T. ∙ Starkl, P. ∙ Reber, L.L. ... A Beneficial Role for Immunoglobulin E in Host Defense against Honeybee Venom Immunity. 2013; 39 :963-975\n36. Palm, N.W. ∙ Rosenstein, R.K. ∙ Yu, S. ... Bee venom phospholipase A2 induces a primary type 2 response that is dependent on the receptor ST2 and confers protective immunity Immunity. 2013; 39 :976-985\n37. Rodewald, H.-R. ∙ Feyerabend, T.B. Widespread Immunological Functions of Mast Cells: Fact or Fiction? Immunity. 2012; 37 :13-24\n38. Plum, T. ∙ Binzberger, R. ∙ Thiele, R. ... Mast cells link immune sensing to antigen-avoidance behaviour Nature. 2023; 620 :634-642\n39. Florsheim, E.B. ∙ Bachtel, N.D. ∙ Cullen, J.L. ... Immune sensing of food allergens promotes avoidance behaviour Nature. 2023; 620 :643-650\n40. Profet, M. The function of allergy: immunological defense against toxins Q. Rev. Biol. 1991; 66 :23-62\n41. Akdis, C.A. Does the epithelial barrier hypothesis explain the increase in allergy, autoimmunity and other chronic conditions? Nat. Rev. Immunol. 2021; 21 :739-751\n42. Strid, J. ∙ Sobolev, O. ∙ Zafirova, B. ... The intraepithelial T cell response to NKG2D-ligands links lymphoid stress surveillance to atopy Science. 2011; 334 :1293-1297\n43. Pothoven, K.L. ∙ Schleimer, R.P. The barrier hypothesis and Oncostatin M: Restoration of epithelial barrier function as a novel therapeutic strategy for the treatment of type 2 inflammatory disease Tissue Barriers. 2017; 5, e1341367\n44. Aguilera-Lizarraga, J. ∙ Florens, M.V. ∙ Viola, M.F. ... Local immune response to food antigens drives meal-induced abdominal pain Nature. 2021; 590 :151-156\n45. Haahtela, T. A biodiversity hypothesis Allergy. 2019; 74 :1445-1456\n46. Palm, N.W. ∙ Rosenstein, R.K. ∙ Medzhitov, R. Allergic host defences Nature. 2012; 484 :465-472\n47. Stremnitzer, C. ∙ Manzano-Szalai, K. ∙ Willensdorfer, A. ... Papain Degrades Tight Junction Proteins of Human Keratinocytes In Vitro and Sensitizes C57BL/6 Mice via the Skin Independent of its Enzymatic Activity or TLR4 Activation J. Invest. Dermatol. 2015; 135 :1790-1800\n48. Chevigné, A. ∙ Jacquet, A. Emerging roles of the protease allergen Der p 1 in house dust mite–induced airway inflammation J. Allergy Clin. Immunol. 2018; 142 :398-400\n49. Tsai, M. ∙ Valent, P. ∙ Galli, S.J. KIT as a master regulator of the mast cell lineage J. Allergy Clin. Immunol. 2022; 149 :1845-1854\n50. Feyerabend, T.B. ∙ Gutierrez, D.A. ∙ Rodewald, H.-R. Of Mouse Models of Mast Cell Deficiency and Metabolic Syndrome Cell Metab. 2016; 24 :1-2\n51. Milenkovic, N. ∙ Frahm, C. ∙ Gassmann, M. ... Nociceptive tuning by stem cell factor/c-Kit signaling Neuron. 2007; 56 :893-906\n52. Nautiyal, K.M. ∙ Ribeiro, A.C. ∙ Pfaff, D.W. ... Brain mast cells link the immune system to anxiety-like behavior Proc. Natl. Acad. Sci. USA. 2008; 105 :18053-18057\n53. Oka, T. ∙ Kalesnikoff, J. ∙ Starkl, P. ... Evidence questioning cromolyn’s effectiveness and selectivity as a “mast cell stabilizer” in mice Lab. Invest. 2012; 92 :1472-1482\n54. Schemann, M. ∙ Kugler, E.M. ∙ Buhner, S. ... The mast cell degranulator compound 48/80 directly activates neurons PLoS One. 2012; 7, e52104\n55. Zhou, Y. ∙ Yu, X. ∙ Chen, H. ... Leptin Deficiency Shifts Mast Cells toward Anti-Inflammatory Actions and Protects Mice from Obesity and Diabetes by Polarizing M2 Macrophages Cell Metab. 2015; 22 :1045-1058\n56. Abu-Dalu, R. ∙ Zhang, J.M. ∙ Hanani, M. The actions of ketotifen on intestinal smooth muscles Eur. J. Pharmacol. 1996; 309 :189-193\n57. Florsheim, E.B. ∙ Sullivan, Z.A. ∙ Khoury-Hanold, W. ... Food allergy as a biological food quality control system Cell. 2021; 184 :1440-1454\n58. Cara, D.C. ∙ Conde, A.A. ∙ Vaz, N.M. Immunological induction of flavor aversion in mice Braz. J. Med. Biol. Res. 1994; 27 :1331-1341\n59. Cara, D.C. ∙ Conde, A.A. ∙ Vaz, N.M. Immunological induction of flavour aversion in mice. II. Passive/adoptive transfer and pharmacological inhibition Scand. J. Immunol. 1997; 45 :16-20\n60. Wallrapp, A. ∙ Chiu, I.M. Neuroimmune Interactions in the Intestine Annu. Rev. Immunol. 2024; 42 :489-519\n61. Jiang, W. ∙ Kreis, M.E. ∙ Eastwood, C. ... 5-HT 3 and histamine H 1 receptors mediate afferent nerve sensitivity to intestinal anaphylaxis in rats Gastroenterology. 2000; 119 :1267-1275\n62. Wang, F. ∙ Trier, A.M. ∙ Li, F. ... A basophil-neuronal axis promotes itch Cell. 2021; 184 :422-440.e17\n63. Voisin, T. ∙ Perner, C. ∙ Messou, M.-A. ... The CysLT 2 R receptor mediates leukotriene C 4 -driven acute and chronic itch Proc. Natl. Acad. Sci. USA. 2021; 118, e2022087118\n64. Borner, T. ∙ Shaulson, E.D. ∙ Ghidewon, M.Y. ... GDF15 Induces Anorexia through Nausea and Emesis Cell Metab. 2020; 31 :351-362.e5\n65. Zhang, C. ∙ Kaye, J.A. ∙ Cai, Z. ... Area Postrema Cell Types that Mediate Nausea-Associated Behaviors Neuron. 2021; 109 :461-472.e5\n66. MacQueen, G. ∙ Marshall, J. ∙ Perdue, M. ... Pavlovian conditioning of rat mucosal mast cells to secrete rat mast cell protease II Science. 1989; 243 :83-85\n67. Koren, T. ∙ Yifa, R. ∙ Amer, M. ... Insular cortex neurons encode and retrieve specific immune responses Cell. 2021; 184 :5902-5915.e17\n68. Costa-Pinto, F.A. ∙ Basso, A.S. ∙ Britto, L.R.G. ... Avoidance behavior and neural correlates of allergen exposure in a murine model of asthma Brain Behav. Immun. 2005; 19 :52-60\n69. Costa-Pinto, F.A. ∙ Basso, A.S. ∙ Russo, M. Role of mast cell degranulation in the neural correlates of the immediate allergic reaction in a murine model of asthma Brain Behav. Immun. 2007; 21 :783-790\n70. Dekker, E. ∙ Pelser, H.E. ∙ Groen, J. Conditioning as a cause of asthmatic attacks: A laboratory study J. Psychosom. Res. 1957; 2 :97-108\n71. Dong, X. ∙ Dong, X. Peripheral and Central Mechanisms of Itch Neuron. 2018; 98 :482-494\n72. Lavich, T.R. ∙ Cordeiro, R.S.B. ∙ Calixto, J.B. ... Combined action of vasoactive amines and bradykinin mediates allergen-evoked thermal hyperalgesia in rats Eur. J. Pharmacol. 2003; 462 :185-192\n73. Mack, M. ∙ Tonc, E. ∙ Ashbaugh, A. ... Clonal differences in IgE antibodies affect cutaneous anaphylaxis-associated thermal sensitivity in mice Immunol. Lett. 2014; 162 :149-158\n74. Meixiong, J. ∙ Anderson, M. ∙ Limjunyawong, N. ... Activation of Mast-Cell-Expressed Mas-Related G-Protein-Coupled Receptors Drives Non-histaminergic Itch Immunity. 2019; 50 :1163-1171.e5\n75. Zeisel, A. ∙ Hochgerner, H. ∙ Lönnerberg, P. ... Molecular Architecture of the Mouse Nervous System Cell. 2018; 174 :999-1014.e22\n76. Andoh, T. ∙ Kuraishi, Y. Expression of Fc epsilon receptor I on primary sensory neurons in mice NeuroReport. 2004; 15 :2029-2031\n77. Xu, X. ∙ Zhang, D. ∙ Zhang, H. ... Neutrophil histamine contributes to inflammation in mycoplasma pneumonia J. Exp. Med. 2006; 203 :2907-2917\n78. Kari, O. ∙ Salo, O.P. ∙ Halmepuro, L. ... Tear histamine during allergic conjunctivitis challenge Graefes Arch. Clin. Exp. Ophthalmol. 1985; 223 :60-62\n79. Miyazaki, D. ∙ Tominaga, T. ∙ Yakura, K. ... Conjunctival mast cell as a mediator of eosinophilic response in ocular allergy Mol. Vis. 2008; 14 :1525-1532\n80. Meng, I.D. ∙ Kurose, M. The role of corneal afferent neurons in regulating tears under normal and dry eye conditions Exp. Eye Res. 2013; 117 :79-87\n81. Yang, L. ∙ Xu, M. ∙ Bhuiyan, S.A. ... Human and mouse trigeminal ganglia cell atlas implicates multiple cell types in migraine Neuron. 2022; 110 :1806-1821.e8\n82. Li, F. ∙ Jiang, H. ∙ Shen, X. ... Sneezing reflex is mediated by a peptidergic pathway from nose to brainstem Cell. 2021; 184 :3762-3773.e10\n83. Jiang, H. ∙ Cui, H. ∙ Chen, M. ... Divergent sensory pathways of sneezing and coughing Cell. 2024; 187 :5981-5997.e14\n84. Lee, M.-G. ∙ Dong, X. ∙ Liu, Q. ... Agonists of the Mas -Related Gene (Mrgs) Orphan Receptors as Novel Mediators of Mast Cell-Sensory Nerve Interactions J. Immunol. 2008; 180 :2251-2255\n85. Karlsson, J.A. ∙ Fuller, R.W. Pharmacological regulation of the cough reflex—from experimental models to antitussive effects in Man. Pulm. Pharmacol. Ther. 1999; 12 :215-228\n86. Bolser, D.C. ∙ DeGennaro, F.C. ∙ O’Reilly, S. ... Pharmacological studies of allergic cough in the guinea pig Eur. J. Pharmacol. 1995; 277 :159-164\n87. McLeod, R.L. ∙ Fernandez, X. ∙ Correll, C.C. ... TRPV1 antagonists attenuate antigen-provoked cough in ovalbumin sensitized guinea pigs Cough. 2006; 2 :10\n88. Mazzone, S.B. ∙ Undem, B.J. Vagal Afferent Innervation of the Airways in Health and Disease Physiol. Rev. 2016; 96 :975-1024\n89. Weigand, L.A. ∙ Myers, A.C. ∙ Meeker, S. ... Mast cell-cholinergic nerve interaction in mouse airways J. Physiol. 2009; 587 :3355-3362\n90. Mendez-Enriquez, E. ∙ Alvarado-Vazquez, P.A. ∙ Abma, W. ... Mast cell-derived serotonin enhances methacholine-induced airway hyperresponsiveness in house dust mite-induced experimental asthma Allergy. 2021; 76 :2057-2069\n91. Canning, B.J. Reflex regulation of airway smooth muscle tone J. Appl. Physiol. (1985). 2006; 101 :971-985\n92. Brandt, E.B. ∙ Strait, R.T. ∙ Hershko, D. ... Mast cells are required for experimental oral allergen–induced diarrhea J. Clin. Invest. 2003; 112 :1666-1677\n93. Keely, S.J. ∙ Barrett, K.E. Intestinal secretory mechanisms and diarrhea Am. J. Physiol. Gastrointest. Liver Physiol. 2022; 322 :G405-G420\n94. Vanuytsel, T. ∙ Tack, J. ∙ Farre, R. The Role of Intestinal Permeability in Gastrointestinal Disorders and Current Methods of Evaluation Front. Nutr. 2021; 8, 717925\n95. Perdue, M.H. ∙ Masson, S. ∙ Wershil, B.K. ... Role of mast cells in ion transport abnormalities associated with intestinal anaphylaxis. Correction of the diminished secretory response in genetically mast cell-deficient W/Wv mice by bone marrow transplantation J. Clin. Invest. 1991; 87 :687-693\n96. Zhong, W. ∙ Shahbaz, O. ∙ Teskey, G. ... Mechanisms of Nausea and Vomiting: Current Knowledge and Recent Advances in Intracellular Emetic Signaling Systems Int. J. Mol. Sci. 2021; 22, 5797\n97. Ono, H.K. ∙ Hirose, S. ∙ Narita, K. ... Histamine release from intestinal mast cells induced by staphylococcal enterotoxin A (SEA) evokes vomiting reflex in common marmoset PLoS Pathog. 2019; 15, e1007803\n98. Hu, D.-L. ∙ Zhu, G. ∙ Mori, F. ... Staphylococcal enterotoxin induces emesis through increasing serotonin release in intestine and it is downregulated by cannabinoid receptor 1 Cell. Microbiol. 2007; 9 :2267-2277\n99. Yamamoto, K. ∙ Matsunaga, S. ∙ Matsui, M. ... Pica in mice as a new model for the study of emesis Methods Find. Exp. Clin. Pharmacol. 2002; 24 :135-138\n100. Portier, P. ∙ Richet, C. De l’action anaphylactique de certains vénins CR Soc. Biol. 1902; 54 :170-172\n101. Metz, M. ∙ Piliponsky, A.M. ∙ Chen, C.-C. ... Mast cells can enhance resistance to snake and honeybee venoms Science. 2006; 313 :526-530\n102. Schneider, L.A. ∙ Schlenner, S.M. ∙ Feyerabend, T.B. ... Molecular mechanism of mast cell mediated innate defense against endothelin and snake venom sarafotoxin J. Exp. Med. 2007; 204 :2629-2639\n103. Reber, L.L. ∙ Hernandez, J.D. ∙ Galli, S.J. The pathophysiology of anaphylaxis J. Allergy Clin. Immunol. 2017; 140 :335-348\n104. Suzuki, R. ∙ Leach, S. ∙ Liu, W. ... Molecular Editing of Cellular Responses by the High-Affinity Receptor for IgE Science. 2014; 343 :1021-1025\n105. Chang, X. ∙ Zha, L. ∙ Wallimann, A. ... Low-affinity but high-avidity interactions may offer an explanation for IgE-mediated allergen cross-reactivity Allergy. 2021; 76 :2565-2574\n106. Bao, C. ∙ Chen, O. ∙ Sheng, H. ... A mast cell–thermoregulatory neuron circuit axis regulates hypothermia in anaphylaxis Sci. Immunol. 2023; 8, eadc9417\n107. Corbière, A. ∙ Loste, A. ∙ Gaudenzio, N. MRGPRX2 sensing of cationic compounds—A bridge between nociception and skin diseases? Exp. Dermatol. 2021; 30 :193-200\n108. Gour, N. ∙ Dong, X. The MRGPR family of receptors in immunity Immunity. 2024; 57 :28-39\n109. McNeil, B.D. ∙ Pundir, P. ∙ Meeker, S. ... Identification of a mast-cell-specific receptor crucial for pseudo-allergic drug reactions Nature. 2015; 519 :237-241\n110. Tatemoto, K. ∙ Nozaki, Y. ∙ Tsuda, R. ... Immunoglobulin E-independent activation of mast cell is mediated by Mrg receptors Biochem. Biophys. Res. Commun. 2006; 349 :1322-1328\n111. Roy, S. ∙ Chompunud Na Ayudhya, C. ∙ Thapaliya, M. ... Multifaceted MRGPRX2: New insight into the role of mast cells in health and disease J. Allergy Clin. Immunol. 2021; 148 :293-308\n112. Azimi, E. ∙ Reddy, V.B. ∙ Shade, K.C. ... Dual action of neurokinin-1 antagonists on Mas-related GPCRs JCI Insight. 2016; 1, e89362\n113. Perner, C. ∙ Flayer, C.H. ∙ Zhu, X. ... Substance P Release by Sensory Neurons Triggers Dendritic Cell Migration and Initiates the Type-2 Immune Response to Allergens Immunity. 2020; 53 :1063-1077.e7\n114. Gour, N. ∙ Yong, H.M. ∙ Magesh, A. ... A GPCR-neuropeptide axis dampens hyperactive neutrophils by promoting an alternative-like polarization during bacterial infection Immunity. 2024; 57 :333-348.e6\n115. McLachlan, J.B. ∙ Shelburne, C.P. ∙ Hart, J.P. ... Mast cell activators: a new class of highly effective vaccine adjuvants Nat. Med. 2008; 14 :536-541\n116. Lopes, D.M. ∙ Denk, F. ∙ Chisholm, K.I. ... Peripheral inflammatory pain sensitisation is independent of mast cell activation in male mice Pain. 2017; 158 :1314-1322\n117. Serhan, N. ∙ Basso, L. ∙ Sibilano, R. ... House dust mites activate nociceptor-mast cell clusters to drive type 2 skin inflammation Nat. Immunol. 2019; 20 :1435-1443\n118. Li, X. ∙ Yuan, D. ∙ Zhang, P. ... A neural-mast cell axis regulates skin microcirculation in diabetes Diabetes. 2024; 73 :1728-1741\n119. Kim, B. ∙ Rothenberg, M.E. ∙ Sun, X. ... Neuroimmune interplay during type 2 inflammation: Symptoms, mechanisms, and therapeutic targets in atopic diseases J. Allergy Clin. Immunol. 2024; 153 :879-893\n120. Walters, E.T. ∙ Williams, A.C.C. Evolution of mechanisms and behaviour important for pain Philos. Trans. R. Soc. Lond. B Biol. Sci. 2019; 374, 20190275\n121. Green, D.P. ∙ Limjunyawong, N. ∙ Gour, N. ... A Mast-Cell-Specific Receptor Mediates Neurogenic Inflammation and Pain Neuron. 2019; 101 :412-420.e3\n122. Moriyama, M. ∙ Sato, T. ∙ Inoue, H. ... The neuropeptide neuromedin U promotes inflammation by direct activation of mast cells J. Exp. Med. 2005; 202 :217-224\n123. Saxena, P. ∙ Broemer, E. ∙ Herrera, G.M. ... Compound 48/80 increases murine bladder wall compliance independent of mast cells Sci. Rep. 2023; 13 :625\n124. Starkl, P. ∙ Jonsson, G. ∙ Artner, T. ... Mast cell–derived BH4 and serotonin are critical mediators of postoperative pain Sci. Immunol. 2024; 9, eadh0545\n125. Chatterjea, D. ∙ Wetzel, A. ∙ Mack, M. ... Mast cell degranulation mediates compound 48/80-induced hyperalgesia in mice Biochem. Biophys. Res. Commun. 2012; 425 :237-243\n126. Inagaki, N. ∙ Igeta, K. ∙ Kim, J.F. ... Involvement of unique mechanisms in the induction of scratching behavior in BALB/c mice by compound 48/80 Eur. J. Pharmacol. 2002; 448 :175-183\n127. Andoh, T. ∙ Nagasawa, T. ∙ Satoh, M. ... Substance P Induction of Itch-Associated Response Mediated by Cutaneous NK1 Tachykinin Receptors in Mice J. Pharmacol. Exp. Ther. 1998; 286 :1140-1145\n128. Solinski, H.J. ∙ Kriegbaum, M.C. ∙ Tseng, P.-Y. ... Nppb Neurons Are Sensors of Mast Cell-Induced Itch Cell Rep. 2019; 26 :3561-3573.e4\n129. Son, H. ∙ Zhang, Y. ∙ Shannonhouse, J. ... PACAP38/mast-cell-specific receptor axis mediates repetitive stress-induced headache in mice J. Headache Pain. 2024; 25 :87\n130. Son, H. ∙ Zhang, Y. ∙ Shannonhouse, J. ... Mast-cell-specific receptor mediates alcohol-withdrawal-associated headache in male mice Neuron. 2024; 112 :113-123.e4\n131. Sbei, S. ∙ Moncrief, T. ∙ Limjunyawong, N. ... PACAP activates MRGPRX2 on meningeal mast cells to drive migraine-like pain Sci. Rep. 2023; 13, 12302\n132. Gordon, J.R. ∙ Galli, S.J. Release of both preformed and newly synthesized tumor necrosis factor alpha (TNF-alpha)/cachectin by mouse mast cells stimulated via the Fc epsilon RI. A mechanism for the sustained action of mast cell-derived TNF-alpha during IgE-dependent biological responses J. Exp. Med. 1991; 174 :103-107\n133. Martin Jensen, M. ∙ Jia, W. ∙ Schults, A.J. ... IL-33 mast cell axis is central in LL-37 induced bladder inflammation and pain in a murine interstitial cystitis model Cytokine. 2018; 110 :420-427\n134. Hayes, B.W. ∙ Choi, H.W. ∙ Rathore, A.P.S. ... Recurrent infections drive persistent bladder dysfunction and pain via sensory nerve sprouting and mast cell activity Sci. Immunol. 2024; 9, eadi5578\n135. Zhang, S. ∙ Edwards, T.N. ∙ Chaudhri, V.K. ... Nonpeptidergic neurons suppress mast cells via glutamate to maintain skin homeostasis Cell. 2021; 184 :2151-2166.e16\n136. Jang, J.H. ∙ Liang, D. ∙ Kido, K. ... Increased local concentration of complement C5a contributes to incisional pain in mice J. Neuroinflammation. 2011; 8 :80\n137. Khodorova, A. ∙ Montmayeur, J.-P. ∙ Strichartz, G. Endothelin receptors and pain J. Pain. 2009; 10 :4-28\n138. Tsai, S.H. ∙ Kinoshita, M. ∙ Kusu, T. ... The Ectoenzyme E-NPP3 Negatively Regulates ATP-Dependent Chronic Allergic Responses by Basophils and Mast Cells Immunity. 2015; 42 :279-293\n139. Molofsky, A.B. ∙ Savage, A.K. ∙ Locksley, R.M. Interleukin-33 in Tissue Homeostasis, Injury, and Inflammation Immunity. 2015; 42 :1005-1019\n140. Johnson, A.R. ∙ Hugli, T.E. ∙ Müller-Eberhard, H.J. Release of histamine from rat mast cells by the complement peptides C3a and C5a Immunology. 1975; 28 :1067-1080\n141. Yamamura, H. ∙ Nabe, T. ∙ Kohno, S. ... Endothelin-1, one of the most potent histamine releasers in mouse peritoneal mast cells Eur. J. Pharmacol. 1994; 265 :9-15\n142. Jang, J.H. ∙ Clark, D.J. ∙ Li, X. ... Nociceptive sensitization by complement C5a and C3a in mouse Pain. 2010; 148 :343-352\n143. Piovezan, A.P. ∙ D’Orléans-Juste, P. ∙ Souza, G.E. ... Endothelin-1-induced ET(A) receptor-mediated nociception, hyperalgesia and oedema in the mouse hind-paw: modulation by simultaneous ET(B) receptor activation Br. J. Pharmacol. 2000; 129 :961-968\n144. Baamonde, A. ∙ Lastra, A. ∙ Villazón, M. ... Involvement of endogenous endothelins in thermal and mechanical inflammatory hyperalgesia in mice Naunyn Schmiedebergs Arch. Pharmacol. 2004; 369 :245-251\n145. Moritz, D.R. ∙ Rodewald, H.R. ∙ Gheyselinck, J. ... The IL-1 receptor-related T1 antigen is expressed on immature and mature mast cells and on fetal blood mast cell progenitors J. Immunol. 1998; 161 :4866-4874\n146. Jiang, Y. ∙ Ye, F. ∙ Du, Y. ... P2X7R in Mast Cells is a Potential Target for Salicylic Acid and Aspirin in Treatment of Inflammatory Pain J. Inflamm. Res. 2021; 14 :2913-2931\n147. Koroleva, K. ∙ Gafurov, O. ∙ Guselnikova, V. ... Meningeal Mast Cells Contribute to ATP-Induced Nociceptive Firing in Trigeminal Nerve Terminals: Direct and Indirect Purinergic Mechanisms Triggering Migraine Pain Front. Cell. Neurosci. 2019; 13 :195\n148. Trier, A.M. ∙ Ver Heul, A.M. ∙ Fredman, A. ... IL-33 potentiates histaminergic itch J. Allergy Clin. Immunol. 2024; 153 :852-859.e3\n149. Enoksson, M. ∙ Lyberg, K. ∙ Möller-Westerberg, C. ... Mast cells as sensors of cell injury through IL-33 recognition J. Immunol. 2011; 186 :2523-2528\n150. Barker, K.H. ∙ Higham, J.P. ∙ Pattison, L.A. ... Sensitization of colonic nociceptors by IL-13 is dependent on JAK and p38 MAPK activity Am. J. Physiol. Gastrointest. Liver Physiol. 2023; 324 :G250-G261\n151. Zhou, Y.-Q. ∙ Liu, Z. ∙ Liu, Z.-H. ... Interleukin-6: an emerging regulator of pathological pain J. Neuroinflammation. 2016; 13 :141\n152. Verri, W.A.J. ∙ Guerrero, A.T.G. ∙ Fukada, S.Y. ... IL-33 mediates antigen-induced cutaneous and articular hypernociception in mice Proc. Natl. Acad. Sci. USA. 2008; 105 :2723-2728\n153. Alhallak, K. ∙ Nagai, J. ∙ Zaleski, K. ... Mast cells control lung type 2 inflammation via prostaglandin E(2)-driven soluble ST2 Immunity. 2024; 57 :1274-1288.e6\n154. Yang, L. ∙ He, H. ∙ Guo, X.-K. ... Intraepithelial mast cells drive gasdermin C-mediated type 2 immunity Immunity. 2024; 57 :1056-1070.e5\n155. Voisin, T. ∙ Bouvier, A. ∙ Chiu, I.M. Neuro-immune interactions in allergic diseases: novel targets for therapeutics Int. Immunol. 2017; 29 :247-261\n156. Church, M.K. ∙ Okayama, Y. ∙ El-Lati, S. Mediator secretion from human skin mast cells provoked by immunological and non-immunological stimulation Skin Pharmacol. 1991; 4 :15-24\n157. Gaudenzio, N. ∙ Sibilano, R. ∙ Marichal, T. ... Different activation signals induce distinct mast cell degranulation strategies J. Clin. Invest. 2016; 126 :3981-3998\n158. Denker, A. Synaptic vesicle pools: an update Front. Synaptic Neurosci. 2010; 2 :135"
}